0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    TOP      
    {
	type freestream;
	freestreamValue uniform (0 0 0);
    }

    BOT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    PLANE      
    {

      type         uniformFixedValue;
      uniformValue
      {
          type             sine;
          frequency        0.08;
          amplitude        0.025;
          scale            (0 0 1);  // Scale factor for wave
          level            (0 0 0);  // Offset
      }
    }




    LEFT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    RIGHT      
    {
        type freestream;
        freestreamValue uniform (0 0 0);
    }

    SYMM    
    {
        type            empty;
    }
}

// ************************************************************************* //
